public class Main {
    public static void main(String[] args) {
//        TaskPerformer.Perform("textEnglish.txt");
        TaskPerformer.Perform("textUkrainian.txt");
    }
}

/*
            Завдання
    У текстовому файлі задана інформація, яка складається з багатьох стрічок.
    Між словами в стрічці може бути один або кілька пропусків.
    Продемонструвати роботу програм для файлів з українським та англійським текстом.
    Зчитати інформацію, використавши клас Scanner.
    Виконати завдання відповідно до призначеного варіанту. Не використовувати регулярні вирази.

            Індивідуальне завдання Варіант 10
    Знайти всі дати, задані різними поширеними форматами.
    Визначити, в якому діапазоні вони знаходяться.
    Поміняти всі дати на наступний день, вставивши після них в дужках день тижня, на який ця дата припадає.
 */